##
# Preflight
##

# Tap homebrew
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'superbrothers/zsh-kubectl-prompt'
tap 'argoproj/tap'


##
# Browsers
#
##

# Firefox web browser
cask 'firefox'

# Firefox developer edition, which features programming tools.
cask 'firefox-developer-edition'

cask 'google-chrome'

cask 'spotify'

##
# Terminals
##
brew 'tmux'
cask 'iterm2'
##
# Shells
#
##
brew 'zsh'
brew 'z'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-kubectl-prompt'

cask 'powershell'

##
# Planning
#
##
cask 'notion'

### Messaging
cask 'slack'

##
# Editors
#
# We typically use command line editors (vim, emacs, etc.)
# and sometimes use GUI editors (atom, sublime, etc.)
##
# Vim editor
brew 'vim'

# Neovim
brew 'neovim'

cask 'visual-studio-code'
cask 'intellij-idea'

##
# Platforms
##

# Azure by Microsoft
brew 'azure-cli'
brew 'awscli'
brew 'gimme-aws-creds'
cask 'google-cloud-sdk'

## Virtual machines

# Packer helps build automated machine images
brew 'packer'

# VirtualBox creates and configures portable development environments, by Oracle.
cask 'virtualbox'

# Vagrant lightweight, reproducible, portable development environments
cask 'vagrant'
cask 'vagrant-manager'
cask 'parallels'
## Provisioning

# Terraform common configuration to launch infrastructure.
brew 'tfenv'
brew 'tgenv'
brew 'terraform-docs'

brew 'conftest'
brew 'opa'

brew 'kubectl'
brew 'octant'
brew 'helm'
brew 'argocd'

brew 'minikube'

brew 'stern'

brew 'act' # https://github.com/nektos/act

## Configuration management

# Ansible is a simple way to automate apps and IT infrastructure.
brew 'ansible'

brew 'stow'
brew 'reattach-to-user-namespace'
brew 'htop'

# Jsonnet is a DSL for json
brew 'jsonnet'
brew 'wget'

brew 'gh'

# Node version manager
brew 'n'
brew 'yarn'
brew 'jabba'

brew 'go'

cask 'dotnet-sdk'

brew 'pipenv'

brew 'maven'

brew 'scalaenv'
brew 'sbtenv'
# FZF is a command line fuzzy finder
brew 'fzf'
brew 'jq'
brew 'yq'

brew 'hugo'

brew 'graphviz'

brew 'corkscrew'
brew 'gettext' # envsubst, etc

##
# Server-Related
##

# Docker software containers to help distribute applications.
brew 'docker'
brew 'boot2docker'

# Docker Machine installs Docker Engine on virtual hosts, and manages the hosts.
brew 'docker-machine'


## Containeriztion

# Docker assembles applications from components.
cask 'docker'

brew 'whalebrew'

## Security
cask '1password'
brew 'gpg'
brew 'sops'

###########################################################################
#
# FONTS
#
###########################################################################

##
# Fonts
##

cask 'font-3270'
cask 'font-hack-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
