##
# Preflight
##

# Tap homebrew
tap 'homebrew/cask'

##
# Browsers
#
##

# Firefox web browser
cask 'firefox'

# Firefox developer edition, which features programming tools.
cask 'firefox-developer-edition'

##
# Terminals
##
brew 'tmux'

##
# Shells
#
##
brew 'zsh'
brew 'z'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'

##
# Editors
#
# We typically use command line editors (vim, emacs, etc.)
# and sometimes use GUI editors (atom, sublime, etc.)
##
# Vim editor
brew 'vim'

# Neovim
brew 'neovim'

##
# Platforms
##

# Azure by Microsoft
brew 'azure-cli'

## Virtual machines

# Packer helps build automated machine images
brew 'packer'

# VirtualBox creates and configures portable development environments, by Oracle.
cask 'virtualbox'

# Vagrant lightweight, reproducible, portable development environments
cask 'vagrant'
cask 'vagrant-manager'

## Provisioning

# Terraform common configuration to launch infrastructure.
brew 'terraform'

## Configuration management

# Ansible is a simple way to automate apps and IT infrastructure.
brew 'ansible'

brew 'stow'

# Jsonnet is a DSL for json
brew 'jsonnet'

# Node version manager
brew 'n'

# FZF is a command line fuzzy finder
brew 'fzf'

brew 'corkscrew'